Ejemplos de invocacion y respuesta:

---- Parte 1 ----
?- perteneceA(eriador,comarca).
>true.

?- perteneceA(gondor,edoras).
>false.

?- perteneceA(gondor,minasTirith).
>true.

?- perteneceA(Region,abismoDeHelm).
>Region = rohan.

?- perteneceA(mordor,Zonas).       
>Zonas = minasMorgul ;
>Zonas = monteDelDestino.

---- Parte 3 ----
Caso 1:
?- zonasLimitrofes(comarca,monteDelDestino).
>false.

Caso 2:
?- zonasLimitrofes(comarca,rivendel).        
>true.

Caso 3:
?- zonasLimitrofes(rivendel,comarca). 
>true.

Caso 4:
?- zonasLimitrofes(rivendel,moria).   
>true 

Caso 5:
?- zonasLimitrofes(moria,rivendel).   
>true 

Caso 6:
?- zonasLimitrofes(Zonas,rivendel). 
Zonas = moria ;
Zonas = comarca ;

---- Parte 4 ----
Caso 7:
>regionesLimitrofes(eriador,montaniasNubladas)
>true

Caso 8:
>regionesLimitrofes(rohan,mordor)
>false

Caso 9:
>regionesLimitrofes(eriador,Cual)}
>montaniasNubladas

Caso 10:
>regionesLimitrofes(gondor,Cual)
>rohan
>mordor

Caso 11:
>regionesLimitrofes(isengard,Cual)
>false

Caso 12:
>regionesLimitrofes(mordor,_)
>true

Caso 13:
>regionesLejanas(rohan,montaniasNubladas)
>false

Caso 14:
>regionesLejanas(eriador,mordor)
>true

Caso 15:
>regionesLejanas(eriador,rohan)
>false

Caso 16:
?- regionesLejanas(Cuales,mordor).
>Cuales = eriador ;
>Cuales = montaniasNubladas ;

Caso 17:
>regionesLejanas(eriador,gondor)
>true

---- Parte 5 ----
Caso 18:
>

Caso 19:
>

Caso 20:
>

---- Parte 6 ----

Caso 23:
?- caminoSeguro([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino]).
true 

Caso 24:
?- caminoSeguro([rivendel,lothlorien,edoras,isengard,abismoDeHelm,minasTirith,minasMorgul]).
false.