Ejemplos de invocacion y respuesta:

---- Parte 1 ----
?- perteneceA(eriador,comarca).
>true.

?- perteneceA(gondor,edoras).
>false.

?- perteneceA(gondor,minasTirith).
>true.

?- perteneceA(Region,abismoDeHelm).
>Region = rohan.

?- perteneceA(mordor,Zonas).       
>Zonas = minasMorgul ;
>Zonas = monteDelDestino.

---- Parte 3 ----
Caso 1:
?- zonasLimitrofes(comarca,monteDelDestino).
>false.

Caso 2:
?- zonasLimitrofes(comarca,rivendel).        
>true.

Caso 3:
?- zonasLimitrofes(rivendel,comarca). 
>true.

Caso 4:
?- zonasLimitrofes(rivendel,moria).   
>true 

Caso 5:
?- zonasLimitrofes(moria,rivendel).   
>true 

Caso 6:
?- zonasLimitrofes(Zonas,rivendel). 
Zonas = moria ;
Zonas = comarca ;

---- Parte 4 ----
Caso 7:
?- regionesLimitrofes(eriador,montaniasNubladas)
>true

Caso 8:
?- regionesLimitrofes(rohan,mordor)
>false

Caso 9:
?- regionesLimitrofes(eriador,Cual)}
>montaniasNubladas

Caso 10:
?- regionesLimitrofes(gondor,Cual)
>rohan
>mordor

Caso 11:
?- regionesLimitrofes(isengard,Cual)
>false

Caso 12:
?- regionesLimitrofes(mordor,_)
>true

Caso 13:
?- regionesLejanas(rohan,montaniasNubladas)
>false

Caso 14:
?- regionesLejanas(eriador,mordor)
>true

Caso 15:
?- regionesLejanas(eriador,rohan)
>false

Caso 16:
?- regionesLejanas(Cuales,mordor).
>Cuales = eriador ;
>Cuales = montaniasNubladas ;

Caso 17:
?- regionesLejanas(eriador,gondor)
>true

---- Parte 5 ----
Caso 18:
?- puedeSeguirCon([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino],minasMorgul).
>true

?- puedeSeguirCon([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino],moria).
>false

Caso 19:
?- puedeSeguirCon([moria,lothlorien,comarca],Cual)
>rivendel.

Caso 20:
?- sonConsecutivos([comarca,rivendel,moria],[lothlorien,edoras,minasTirith]).
>true

?- sonConsecutivos([comarca,rivendel,isengard],[edoras,minasTirith,monteDelDestino]).
>true

?- sonConsecutivos([comarca,rivendel,isengard],[minasTirith,monteDelDestino,minasMorgul]).
>false

---- Parte 6 ----

Caso 21:
?- caminoLogico([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino]).
>true

Caso 22
?- caminoLogico([comarca,rivendel,lothlorien,edoras,monteDelDestino]).
>false

Caso 23:
?- caminoSeguro([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino]).
>true 

Caso 24:
?- caminoSeguro([rivendel,lothlorien,edoras,isengard,abismoDeHelm,minasTirith,minasMorgul]).
>false.
----------- Trabajo Practico 2 -----------
---- Punto 1 ----
Caso 1:
Caso 2:
Caso 3:
Caso 4:
Caso 5:
Caso 6:
Caso 7:
Caso 8:
---- Punto 3 ----
Caso 9:
Caso 10:
Caso 11:
Caso 12:
Caso 13:
Caso 14:
Caso 15:
Caso 16:
Caso 17:
Caso 18:
Caso 19:
Caso 20:
Caso 21:
Caso 22:
Caso 23:
Caso 24:
Caso 25:
Caso 26:
Caso 27:
Caso 28:
Caso 29:
---- Punto 4 ----
Caso 30:
Caso 31:
Caso 32:
Caso 33:
Caso 34:
Caso 35:
Caso 36:
Caso 37:
Caso 38:
Caso 39:
---- Punto 5 ----
Caso 40:
Caso 41:
Caso 42:
Caso 43:
Caso 44:
Caso 45:
Caso 46:
Caso 47:
Caso 48: