Ejemplos de invocacion y respuesta:

---- Parte 1 ----
?- perteneceA(comarca,eriador).
>true.

?- perteneceA(edoras,gondor).
>false.

?- perteneceA(minasTirith,gondor).
>true.

?- perteneceA(abismoDeHelm,Region).
>Region = rohan.

?- perteneceA(Zonas,mordor).       
>Zonas = minasMorgul ;
>Zonas = monteDelDestino.

---- Parte 3 ----
Caso 1:
?- zonasLimitrofes(comarca,monteDelDestino).
>false.

Caso 2:
?- zonasLimitrofes(comarca,rivendel).        
>true.

Caso 3:
?- zonasLimitrofes(rivendel,comarca). 
>true.

Caso 4:
?- zonasLimitrofes(rivendel,moria).   
>true 

Caso 5:
?- zonasLimitrofes(moria,rivendel).   
>true 

Caso 6:
?- zonasLimitrofes(Zonas,rivendel). 
Zonas = moria ;
Zonas = comarca ;

---- Parte 4 ----
Caso 7:
?- regionesLimitrofes(eriador,montaniasNubladas)
>true

Caso 8:
?- regionesLimitrofes(rohan,mordor)
>false

Caso 9:
?- regionesLimitrofes(eriador,Cual)}
>montaniasNubladas

Caso 10:
?- regionesLimitrofes(gondor,Cual)
>rohan
>mordor

Caso 11:
?- regionesLimitrofes(isengard,Cual)
>false

Caso 12:
?- regionesLimitrofes(mordor,_)
>true

Caso 13:
?- regionesLejanas(rohan,montaniasNubladas)
>false

Caso 14:
?- regionesLejanas(eriador,mordor)
>true

Caso 15:
?- regionesLejanas(eriador,rohan)
>false

Caso 16:
?- regionesLejanas(Cuales,mordor).
>Cuales = eriador ;
>Cuales = montaniasNubladas ;

Caso 17:
?- regionesLejanas(eriador,gondor)
>true

---- Parte 5 ----
Caso 18:
?- puedeSeguirCon([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino],minasMorgul).
>true

?- puedeSeguirCon([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino],moria).
>false

Caso 19:
?- puedeSeguirCon([moria,lothlorien,comarca],Cual)
>rivendel.

Caso 20:
?- sonConsecutivos([comarca,rivendel,moria],[lothlorien,edoras,minasTirith]).
>true

?- sonConsecutivos([comarca,rivendel,isengard],[edoras,minasTirith,monteDelDestino]).
>true

?- sonConsecutivos([comarca,rivendel,isengard],[minasTirith,monteDelDestino,minasMorgul]).
>false

---- Parte 6 ----

Caso 21:
?- caminoLogico([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino]).
>true

Caso 22
?- caminoLogico([comarca,rivendel,lothlorien,edoras,monteDelDestino]).
>false

Caso 23:
?- caminoSeguro([comarca,rivendel,moria,lothlorien,edoras,minasTirith,minasMorgul,monteDelDestino]).
>true 

Caso 24:
?- caminoSeguro([rivendel,lothlorien,edoras,isengard,abismoDeHelm,minasTirith,minasMorgul]).
>false.
----------- Trabajo Practico 2 -----------
---- Punto 1 ----
Caso 1:
?- cantidadDeRegiones([comarca,rivendel,moria], 2).
true.
Caso 2:
?- cantidadDeRegiones([minasTirith,minasMorgul], Cuantos).
Cuantos = 2.
Caso 3:
?- cantidadDeRegiones([moria,isengard,edoras,minasMorgul,minasTirith], 2).
false.
Caso 4:
?- esVueltero([rivendel,comarca]).
false.
Caso 5:
?- esVueltero([rivendel,comarca,rivendel]).
true.
Caso 6:
?- esVueltero([isengard,moria,lothlorien,edoras,isengard]).  
true.
Caso 7:
?- todosLosCaminosConducenAMordor([[minasTirith,minasMorgul],[minasTirith,minasMorgul,monteDelDestino],[monteDelDestino,minasMorgul,minasTirith,minasMorgul]]).
true ;
Caso 8:
?- todosLosCaminosConducenAMordor([[minasTirith,minasMorgul],[minasTirith,minasMorgul,monteDelDestino],[monteDelDestino,minasMorgul,minasTirith]]).
false.
---- Punto 3 ----
Caso 9:
?- razaViajero(gandalf,maiar).
true.
Caso 10:
?- razaViajero(legolas,elfo).
true.
Caso 11:
?- razaViajero(gorbag,orco).
true.
Caso 12:
?- razaViajero(ugluk,uruk-hai).
true
Caso 13:
?- razaViajero(frodo,hobbit).
true.
Caso 14:
?- razaViajero(barbol,ent).
true.
Caso 15:
?- razaViajero(ugluk,Raza).
Raza = uruk-hai

?- razaViajero(Persona,uruk-hai).
Persona = ugluk
Caso 16:
?- armaViajero(gandalf,baston).  
true ;
Caso 17:
?- armaViajero(barbol,fuerza).   
true ;
Caso 18:
?- armaViajero(frodo,espadaCorta).
true ;
Caso 19:
?- armaViajero(sam,daga).        
true ;
Caso 20:
?- armaViajero(ugluk,espada). 
true ;
?- armaViajero(ugluk,arco).   
true.
Caso 21:
?- armaViajero(Viajero,Arma). 
Viajero = gandalf,
Arma = baston ;
Viajero = sam,
Arma = daga ;
Viajero = frodo,
Arma = espadaCorta ;
...
Caso 22:
?- nivelViajero(gandalf,25).
true.
Caso 23:
?- nivelViajero(gorbag,Cual).
Cual = 24.
Caso 24:
?- nivelViajero(legolas,29).
true.
Caso 25:
?- nivelViajero(sam,9).
true.
Caso 26:
?- nivelViajero(barbol,Cual).
Cual = 53
Caso 27:
?- nivelViajero(Quien,26).
Quien = ugluk
Quien = gimli
Quien = boromir
Caso 28:
?- nivelViajero(Quien,22).
false.
Caso 29:
?- nivelViajero(Quienes,25).
Quienes = gandalf.
---- Punto 4 ----
Caso 30:
?- grupo([frodo,sam,merry,pippin]).
false.
Caso 31:
?- grupo([legolas,gimli]).          
true ;

Caso 32:
?- grupo([A,B]).
A = gandalf,
B = legolas ;
A = gandalf,
B = legolas ;
A = gandalf,
B = gimli ;
...

Caso 32:
?- cumpleRequerimiento(elemento(armaduraMithril, 1),[gandalf,aragorn,frodo]).
true.
Caso 33:
?- cumpleRequerimiento(magia(200),[gandalf,aragorn,legolas,gimli]).                   
true.
Caso 34:
?- cumpleRequerimiento(integrante(maiar, 27), [gandaf,sam,frodo]).
false.
Caso 35:
?- cumpleRequerimiento(integrante(maiar, 25), [gandalf,legolas,aragorn]).
true.
Caso 36:
?- cumpleRequerimiento(elemento(lembas, 2),[frodo,sam]).           
true ;
Caso 37:
?- cumpleRequerimiento(integrante(maiar, 25), [gorbag,ugluk]).
false.
Caso 38:
?- puedeAtravesar(moria, [gandalf,aragorn,frodo]).
true.
Caso 39:
?- puedeAtravesar(abismoDeHelm, Grupo).
true.
---- Punto 5 ----
Caso 40:
?- puedeAtravesar(isengard, Grupo).

Caso 41:
?- puedeAtravesar(minasMorgul, [frodo,sam]).
true.
Caso 42:

Caso 43:
Caso 44:
Caso 45:
?- seSientenComoEnCasa([frodo,sam], eriador).
true.
Caso 46:
?- seSientenComoEnCasa([frodo,sam], rohan).
false.
Caso 47:
?- seSientenComoEnCasa([_,_], rohan).
false.
Caso 48:
?- seSientenComoEnCasa([_,_], mordor).
true.